In [133]:
import numpy as np 
import pandas as pd

In [134]:
df =pd.read_csv('D:/AMIT/Data Science Preparation/task/Example/tips.csv')

In [135]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [136]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [138]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [139]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [140]:
for col in df.columns:
    if col in ['sex', 'day', 'time']:
        df[col]=df[col].astype('string')

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    string
 3   smoker      244 non-null    object
 4   day         244 non-null    string
 5   time        244 non-null    string
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(1), string(3)
memory usage: 13.5+ KB

In [142]:
df['bill+tip']=df['total_bill'] + df['tip']

In [143]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size  bill+tip
0       16.99  1.01  Female     No  Sun  Dinner     2     18.00
1       10.34  1.66    Male     No  Sun  Dinner     3     12.00
2       21.01  3.50    Male     No  Sun  Dinner     3     24.51

In [144]:
df.drop(columns='bill+tip',axis=0,inplace=True)

In [145]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

## Q1: What is the total profit if its percentage of the total_bill is 0.86 ?

In [146]:
df.loc[:,'total_bill']*0.86

0      14.6114
1       8.8924
2      18.0686
3      20.3648
4      21.1474
        ...
239    24.9658
240    23.3748
241    19.4962
242    15.3252
243    16.1508
Name: total_bill, Length: 244, dtype: float64

In [147]:
def total_profit(d):
    return d['total_bill']*(0.86)

In [148]:
df.groupby(df.index).apply(total_profit)

0    0      14.6114
1    1       8.8924
2    2      18.0686
3    3      20.3648
4    4      21.1474
             ...
239  239    24.9658
240  240    23.3748
241  241    19.4962
242  242    15.3252
243  243    16.1508
Name: total_bill, Length: 244, dtype: float64

In [149]:
df['profit'] = df['total_bill'] * 0.86

In [150]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size   profit
0       16.99  1.01  Female     No  Sun  Dinner     2  14.6114
1       10.34  1.66    Male     No  Sun  Dinner     3   8.8924
2       21.01  3.50    Male     No  Sun  Dinner     3  18.0686

### Q2: Who pays more , women or men ?

In [153]:
df.groupby("sex")['total_bill'].sum(numeric_only=True) #.max()

sex
Female    1570.95
Male      3256.82
Name: total_bill, dtype: float64

## Q3: On what day of the week was the biggest profit ?

In [154]:
df.groupby('day')['profit'].max() #max bill

day
Fri     34.5462
Sat     43.6966
Sun     41.4262
Thur    37.0746
Name: profit, dtype: float64

## Q4: What is the gender of the person who paid the largest tip?

In [156]:
df.groupby("sex")['tip'].max() #.max()

sex
Female     6.5
Male      10.0
Name: tip, dtype: float64

In [157]:
df.loc[:,['sex','tip']].max()

sex    Male
tip    10.0
dtype: object

In [158]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size   profit
0       16.99  1.01  Female     No  Sun  Dinner     2  14.6114
1       10.34  1.66    Male     No  Sun  Dinner     3   8.8924
2       21.01  3.50    Male     No  Sun  Dinner     3  18.0686

In [212]:
df.groupby('sex').aggregate({'total_bill':np.mean,'tip':np.sum,'smoker':'count','size':max})

        total_bill     tip  smoker  size
sex
Female   18.056897  246.51      87     6
Male     20.744076  485.07     157     6

In [160]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size   profit
0       16.99  1.01  Female     No  Sun  Dinner     2  14.6114
1       10.34  1.66    Male     No  Sun  Dinner     3   8.8924
2       21.01  3.50    Male     No  Sun  Dinner     3  18.0686

In [213]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    string
 3   smoker      244 non-null    int32
 4   day         244 non-null    string
 5   time        244 non-null    string
 6   size        244 non-null    int64
 7   profit      244 non-null    float64
dtypes: float64(3), int32(1), int64(1), string(3)
memory usage: 14.4 KB

In [162]:
df.loc[(df.total_bill > df.total_bill.mean()) & (df.tip > df.tip.mean())][['sex','total_bill','tip']]

        sex  total_bill   tip
2      Male       21.01  3.50
3      Male       23.68  3.31
4    Female       24.59  3.61
5      Male       25.29  4.71
7      Male       26.88  3.12
..      ...         ...   ...
216    Male       28.15  3.00
219  Female       30.14  3.09
227    Male       20.45  3.00
238  Female       35.83  4.67
239    Male       29.03  5.92

[78 rows x 3 columns]

In [218]:
df.loc[df.day.isin(['Sat','Thur'])][['sex','smoker','time']]

        sex  smoker    time
19     Male       0  Dinner
20     Male       0  Dinner
21   Female       0  Dinner
22   Female       0  Dinner
23     Male       0  Dinner
..      ...     ...     ...
239    Male       0  Dinner
240  Female       1  Dinner
241    Male       1  Dinner
242    Male       0  Dinner
243  Female       0  Dinner

[149 rows x 3 columns]

In [165]:
df['smoker'].value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [168]:
df['smoker'].replace(to_replace='Yes',value=1,inplace=True)
df['smoker'].replace(to_replace='No',value=0,inplace=True)

In [174]:
df['smoker']=df['smoker'].astype('int')

In [175]:
df['smoker'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 244 entries, 0 to 243
Series name: smoker
Non-Null Count  Dtype
--------------  -----
244 non-null    int32
dtypes: int32(1)
memory usage: 1.1 KB

In [176]:
df['smoker'].value_counts()

0    151
1     93
Name: smoker, dtype: int64

In [177]:
df.head(2)

   total_bill   tip     sex  smoker  day    time  size   profit
0       16.99  1.01  Female       0  Sun  Dinner     2  14.6114
1       10.34  1.66    Male       0  Sun  Dinner     3   8.8924

In [180]:
df.groupby('sex').count()['smoker']

sex
Female     87
Male      157
Name: smoker, dtype: int64

In [191]:
df.groupby('smoker')['tip'].max()

smoker
0     9.0
1    10.0
Name: tip, dtype: float64

In [193]:
df.groupby('time')['smoker'].count()

time
Dinner    176
Lunch      68
Name: smoker, dtype: int64

In [221]:
df.groupby(['sex','smoker'])['size'].sum()

sex     smoker
Female  0         140
        1          74
Male    0         263
        1         150
Name: size, dtype: int64